<a href="https://colab.research.google.com/github/azizdafi/Practice-and-revision-material/blob/main/SQL_Revision_Material.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##What is SQL?  
SQL stands for Structured Query Language  
SQL lets you access and manipulate databases  
SQL became a standard of the American National Standards Institute (ANSI) in 1986, and of the International Organization for Standardization (ISO) in 1987

##What Can SQL do?
SQL can execute queries against a database  
SQL can retrieve data from a database  
SQL can insert records in a database  
SQL can update records in a database  
SQL can delete records from a database  
SQL can create new databases  
SQL can create new tables in a database  
SQL can create stored procedures in a database  
SQL can create views in a database  
SQL can set permissions on tables, procedures, and views  

##RDBMS
RDBMS stands for Relational Database Management System.

RDBMS is the basis for SQL, and for all modern database systems such as MS SQL Server, IBM DB2, Oracle, MySQL, and Microsoft Access.

The data in RDBMS is stored in database objects called tables. A table is a collection of related data entries and it consists of columns and rows.

Every table is broken up into smaller entities called fields. The fields in the Customers table consist of CustomerID, CustomerName, ContactName, Address, City, PostalCode and Country. A field is a column in a table that is designed to maintain specific information about every record in the table.

A record, also called a row, is each individual entry that exists in a table. For example, there are 91 records in the above Customers table. A record is a horizontal entity in a table.

A column is a vertical entity in a table that contains all information associated with a specific field in a table.

#SQL keywords are NOT case sensitive: select is the same as SELECT

## Some of The Most Important SQL Commands
SELECT - extracts data from a database  
UPDATE - updates data in a database  
DELETE - deletes data from a database  
INSERT INTO - inserts new data into a database  
CREATE DATABASE - creates a new database  
ALTER DATABASE - modifies a database  
CREATE TABLE - creates a new table  
ALTER TABLE - modifies a table  
DROP TABLE - deletes a table  
CREATE INDEX - creates an index (search key)  
DROP INDEX - deletes an index

###genral syntax for SQL query:  
SELECT column1, column2, ...  
FROM table_name;  

example:  
SELECT columname1, columnname2 FROM tablename

---
###selecting distinct values of a column:  
SELECT DISTINCT Country FROM Customers


---
###Counting the distinct number of country
SELECT COUNT(DISTINCT Country) FROM Customers

---
###WHERE Syntax
SELECT column1, column2, ...  
FROM table_name  
WHERE condition1 AND condition2 AND condition3 ...

###condition operators for SQL
'='	Equal
'\>'	Greater than
'<'	Less than
\'>='	Greater than or equal
'<='	Less than or equal
'<>'	Not equal. Note: In some versions of SQL this operator may be written as '!='
'BETWEEN'	Between a certain range
'LIKE'	Search for a pattern
'IN'	To specify multiple possible values for a column

#Some examples for various conditions

---
SELECT * FROM Customers
WHERE Country='Mexico'

---
SELECT * FROM Customers  
WHERE Country='Germany' AND City='Berlin'  

---
SELECT * FROM Customers  
WHERE Country='Germany' AND (City='Berlin' OR City='MÃ¼nchen')

###Order By

SELECT * FROM Customers  
ORDER BY Country DESC  

---
SELECT * FROM Customers  
ORDER BY Country ASC  

---
sorted by the "Country" and the "CustomerName" column. This means that it orders by Country, but if some rows have the same Country, it orders them by CustomerName

SELECT * FROM Customers  
ORDER BY Country, CustomerName

###INSERT INTO Statement
####Syntax  
INSERT INTO table_name (column1, column2, column3, ...)  
VALUES (value1, value2, value3, ...)  

If you are adding values for all the columns of the table, you do not need to specify the column names in the SQL query.  
INSERT INTO table_name  
VALUES (value1, value2, value3, ...)  

####Example
INSERT INTO Customers (CustomerName, City, Country)  
VALUES ('Cardinal', 'Stavanger', 'Norway')

###NULL Values
A field with a NULL value is a field with no value.
#### Example
SELECT CustomerName, ContactName, Address  
FROM Customers  
WHERE Address IS NULL  


####similarly we can use not null

###UPDATE
The UPDATE statement is used to modify the existing records in a table.

####Syntax
UPDATE table_name  
SET column1 = value1, column2 = value2, ...  
WHERE condition  

####Example
UPDATE Customers  
SET ContactName = 'Alfred Schmidt', City= 'Frankfurt'  
WHERE CustomerID = 1  

**Note: Be careful when updating records. If you omit the WHERE clause, ALL records will be updated!**

###Delete
DELETE FROM Customers WHERE CustomerName='Alfreds Futterkiste'

**It is possible to delete all rows in a table without deleting the table. This means that the table structure, attributes, and indexes will be intact:**

DELETE FROM table_name

###Limit

SELECT column_name(s)  
FROM table_name  
WHERE condition  
LIMIT number  

example  
SELECT * FROM Customers  
LIMIT 3

###MIN() and Max()
SELECT MIN(column_name)  
FROM table_name  
WHERE condition  

SELECT MIN(Price) AS SmallestPrice  
FROM Products  

SELECT MAX(Price) AS LargestPrice  
FROM Products

###Count(), SUM(), AVG()

SELECT COUNT(ProductID)  
FROM Products  

---
SELECT SUM(Quantity)  
FROM OrderDetails  

---
SELECT AVG(Price)  
FROM Products

###LIKE

The LIKE operator is used in a WHERE clause to search for a specified pattern in a column.

####Syntax
SELECT column1, column2, ...  
FROM table_name  
WHERE columnN LIKE pattern  

**Wildcards**
%	Represents zero or more characters  
_	Represents a single character  
[]	Represents any single character within the brackets	h[oa]t finds hot and hat, but not hit  
^	Represents any character not in the brackets	h[^oa]t finds hit, but not hot and hat  
\-	Represents any single character within the specified range c[a-b]t finds cat and cbt  

**Some examples:**
WHERE CustomerName LIKE 'a%'
Finds any values that start with "a"  

WHERE CustomerName LIKE '%a'
Finds any values that end with "a"  

WHERE CustomerName LIKE '%or%'
Finds any values that have "or" in any position  

WHERE CustomerName LIKE '_r%'
Finds any values that have "r" in the second position  

WHERE CustomerName LIKE 'a_%'
Finds any values that start with "a" and are at least 2 characters in length  

WHERE CustomerName LIKE 'a__%'
Finds any values that start with "a" and are at least 3 characters in length  

WHERE ContactName LIKE 'a%o'
Finds any values that start with "a" and ends with "o"